module TestAfghanistan

using Dates
using Holidays
using Test

include("../util.jl")

@testset "Afghanistan" begin
    calendar = Holidays.Afghanistan()

    holidays = Date[
        Date(1970, 2, 15), # روز عرفه (برآورد شده)
        Date(1970, 2, 16), # عید قربانی (برآورد شده)
        Date(1970, 2, 17), # عید قربانی (برآورد شده)
        Date(1970, 2, 18), # عید قربانی (برآورد شده)
        Date(1970, 3, 18), # عاشورا (برآورد شده)
        Date(1970, 3, 21), # نوروز
        Date(1970, 5, 18), # میلاد پیامبر (برآورد شده)
        Date(1970, 8, 19), # روز استقلال افغانستان
        Date(1970, 11, 1), # اول رمضان (برآورد شده)
        Date(1970, 11, 30), # عید فطر (برآورد شده)
        Date(1970, 12, 1), # عید فطر (برآورد شده)
        Date(1970, 12, 2), # عید فطر (برآورد شده)
        Date(1971, 2, 5), # روز عرفه (برآورد شده)
        Date(1971, 2, 6), # عید قربانی (برآورد شده)
        Date(1971, 2, 7), # عید قربانی (برآورد شده)
        Date(1971, 2, 8), # عید قربانی (برآورد شده)
        Date(1971, 3, 7), # عاشورا (برآورد شده)
        Date(1971, 3, 21), # نوروز
        Date(1971, 5, 7), # میلاد پیامبر (برآورد شده)
        Date(1971, 8, 19), # روز استقلال افغانستان
        Date(1971, 10, 20), # اول رمضان (برآورد شده)
        Date(1971, 11, 19), # عید فطر (برآورد شده)
        Date(1971, 11, 20), # عید فطر (برآورد شده)
        Date(1971, 11, 21), # عید فطر (برآورد شده)
        Date(1972, 1, 25), # روز عرفه (برآورد شده)
        Date(1972, 1, 26), # عید قربانی (برآورد شده)
        Date(1972, 1, 27), # عید قربانی (برآورد شده)
        Date(1972, 1, 28), # عید قربانی (برآورد شده)
        Date(1972, 2, 25), # عاشورا (برآورد شده)
        Date(1972, 3, 21), # نوروز
        Date(1972, 4, 25), # میلاد پیامبر (برآورد شده)
        Date(1972, 8, 19), # روز استقلال افغانستان
        Date(1972, 10, 8), # اول رمضان (برآورد شده)
        Date(1972, 11, 7), # عید فطر (برآورد شده)
        Date(1972, 11, 8), # عید فطر (برآورد شده)
        Date(1972, 11, 9), # عید فطر (برآورد شده)
        Date(1973, 1, 13), # روز عرفه (برآورد شده)
        Date(1973, 1, 14), # عید قربانی (برآورد شده)
        Date(1973, 1, 15), # عید قربانی (برآورد شده)
        Date(1973, 1, 16), # عید قربانی (برآورد شده)
        Date(1973, 2, 13), # عاشورا (برآورد شده)
        Date(1973, 3, 21), # نوروز
        Date(1973, 4, 15), # میلاد پیامبر (برآورد شده)
        Date(1973, 8, 19), # روز استقلال افغانستان
        Date(1973, 9, 27), # اول رمضان (برآورد شده)
        Date(1973, 10, 27), # عید فطر (برآورد شده)
        Date(1973, 10, 28), # عید فطر (برآورد شده)
        Date(1973, 10, 29), # عید فطر (برآورد شده)
        Date(1974, 1, 2), # روز عرفه (برآورد شده)
        Date(1974, 1, 3), # عید قربانی (برآورد شده)
        Date(1974, 1, 4), # عید قربانی (برآورد شده)
        Date(1974, 1, 5), # عید قربانی (برآورد شده)
        Date(1974, 2, 2), # عاشورا (برآورد شده)
        Date(1974, 3, 21), # نوروز
        Date(1974, 4, 4), # میلاد پیامبر (برآورد شده)
        Date(1974, 5, 1), # روز جهانی کارگر
        Date(1974, 8, 19), # روز استقلال افغانستان
        Date(1974, 9, 17), # اول رمضان (برآورد شده)
        Date(1974, 10, 16), # عید فطر (برآورد شده)
        Date(1974, 10, 17), # عید فطر (برآورد شده)
        Date(1974, 10, 18), # عید فطر (برآورد شده)
        Date(1974, 12, 23), # روز عرفه (برآورد شده)
        Date(1974, 12, 24), # عید قربانی (برآورد شده)
        Date(1974, 12, 25), # عید قربانی (برآورد شده)
        Date(1974, 12, 26), # عید قربانی (برآورد شده)
        Date(1975, 1, 22), # عاشورا (برآورد شده)
        Date(1975, 3, 21), # نوروز
        Date(1975, 3, 24), # میلاد پیامبر (برآورد شده)
        Date(1975, 5, 1), # روز جهانی کارگر
        Date(1975, 8, 19), # روز استقلال افغانستان
        Date(1975, 9, 6), # اول رمضان (برآورد شده)
        Date(1975, 10, 6), # عید فطر (برآورد شده)
        Date(1975, 10, 7), # عید فطر (برآورد شده)
        Date(1975, 10, 8), # عید فطر (برآورد شده)
        Date(1975, 12, 12), # روز عرفه (برآورد شده)
        Date(1975, 12, 13), # عید قربانی (برآورد شده)
        Date(1975, 12, 14), # عید قربانی (برآورد شده)
        Date(1975, 12, 15), # عید قربانی (برآورد شده)
        Date(1976, 1, 11), # عاشورا (برآورد شده)
        Date(1976, 3, 12), # میلاد پیامبر (برآورد شده)
        Date(1976, 3, 21), # نوروز
        Date(1976, 5, 1), # روز جهانی کارگر
        Date(1976, 8, 19), # روز استقلال افغانستان
        Date(1976, 8, 26), # اول رمضان (برآورد شده)
        Date(1976, 9, 24), # عید فطر (برآورد شده)
        Date(1976, 9, 25), # عید فطر (برآورد شده)
        Date(1976, 9, 26), # عید فطر (برآورد شده)
        Date(1976, 11, 30), # روز عرفه (برآورد شده)
        Date(1976, 12, 1), # عید قربانی (برآورد شده)
        Date(1976, 12, 2), # عید قربانی (برآورد شده)
        Date(1976, 12, 3), # عید قربانی (برآورد شده)
        Date(1976, 12, 31), # عاشورا (برآورد شده)
        Date(1977, 3, 2), # میلاد پیامبر (برآورد شده)
        Date(1977, 3, 21), # نوروز
        Date(1977, 5, 1), # روز جهانی کارگر
        Date(1977, 8, 15), # اول رمضان (برآورد شده)
        Date(1977, 8, 19), # روز استقلال افغانستان
        Date(1977, 9, 14), # عید فطر (برآورد شده)
        Date(1977, 9, 15), # عید فطر (برآورد شده)
        Date(1977, 9, 16), # عید فطر (برآورد شده)
        Date(1977, 11, 20), # روز عرفه (برآورد شده)
        Date(1977, 11, 21), # عید قربانی (برآورد شده)
        Date(1977, 11, 22), # عید قربانی (برآورد شده)
        Date(1977, 11, 23), # عید قربانی (برآورد شده)
        Date(1977, 12, 20), # عاشورا (برآورد شده)
        Date(1978, 2, 19), # میلاد پیامبر (برآورد شده)
        Date(1978, 3, 21), # نوروز
        Date(1978, 5, 1), # روز جهانی کارگر
        Date(1978, 5, 9), # روز پیروزی شوروی
        Date(1978, 8, 5), # اول رمضان (برآورد شده)
        Date(1978, 8, 19), # روز استقلال افغانستان
        Date(1978, 9, 3), # عید فطر (برآورد شده)
        Date(1978, 9, 4), # عید فطر (برآورد شده)
        Date(1978, 9, 5), # عید فطر (برآورد شده)
        Date(1978, 11, 9), # روز عرفه (برآورد شده)
        Date(1978, 11, 10), # عید قربانی (برآورد شده)
        Date(1978, 11, 11), # عید قربانی (برآورد شده)
        Date(1978, 11, 12), # عید قربانی (برآورد شده)
        Date(1978, 12, 10), # عاشورا (برآورد شده)
        Date(1979, 2, 9), # میلاد پیامبر (برآورد شده)
        Date(1979, 3, 21), # نوروز
        Date(1979, 5, 1), # روز جهانی کارگر
        Date(1979, 5, 9), # روز پیروزی شوروی
        Date(1979, 7, 25), # اول رمضان (برآورد شده)
        Date(1979, 8, 19), # روز استقلال افغانستان
        Date(1979, 8, 23), # عید فطر (برآورد شده)
        Date(1979, 8, 24), # عید فطر (برآورد شده)
        Date(1979, 8, 25), # عید فطر (برآورد شده)
        Date(1979, 10, 30), # روز عرفه (برآورد شده)
        Date(1979, 10, 31), # عید قربانی (برآورد شده)
        Date(1979, 11, 1), # عید قربانی (برآورد شده)
        Date(1979, 11, 2), # عید قربانی (برآورد شده)
        Date(1979, 11, 29), # عاشورا (برآورد شده)
        Date(1980, 1, 30), # میلاد پیامبر (برآورد شده)
        Date(1980, 3, 21), # نوروز
        Date(1980, 5, 1), # روز جهانی کارگر
        Date(1980, 5, 9), # روز پیروزی شوروی
        Date(1980, 7, 13), # اول رمضان (برآورد شده)
        Date(1980, 8, 12), # عید فطر (برآورد شده)
        Date(1980, 8, 13), # عید فطر (برآورد شده)
        Date(1980, 8, 14), # عید فطر (برآورد شده)
        Date(1980, 8, 19), # روز استقلال افغانستان
        Date(1980, 10, 18), # روز عرفه (برآورد شده)
        Date(1980, 10, 19), # عید قربانی (برآورد شده)
        Date(1980, 10, 20), # عید قربانی (برآورد شده)
        Date(1980, 10, 21), # عید قربانی (برآورد شده)
        Date(1980, 11, 18), # عاشورا (برآورد شده)
        Date(1981, 1, 18), # میلاد پیامبر (برآورد شده)
        Date(1981, 3, 21), # نوروز
        Date(1981, 5, 1), # روز جهانی کارگر
        Date(1981, 5, 9), # روز پیروزی شوروی
        Date(1981, 7, 2), # اول رمضان (برآورد شده)
        Date(1981, 8, 1), # عید فطر (برآورد شده)
        Date(1981, 8, 2), # عید فطر (برآورد شده)
        Date(1981, 8, 3), # عید فطر (برآورد شده)
        Date(1981, 8, 19), # روز استقلال افغانستان
        Date(1981, 10, 7), # روز عرفه (برآورد شده)
        Date(1981, 10, 8), # عید قربانی (برآورد شده)
        Date(1981, 10, 9), # عید قربانی (برآورد شده)
        Date(1981, 10, 10), # عید قربانی (برآورد شده)
        Date(1981, 11, 6), # عاشورا (برآورد شده)
        Date(1982, 1, 7), # میلاد پیامبر (برآورد شده)
        Date(1982, 3, 21), # نوروز
        Date(1982, 5, 1), # روز جهانی کارگر
        Date(1982, 5, 9), # روز پیروزی شوروی
        Date(1982, 6, 22), # اول رمضان (برآورد شده)
        Date(1982, 7, 21), # عید فطر (برآورد شده)
        Date(1982, 7, 22), # عید فطر (برآورد شده)
        Date(1982, 7, 23), # عید فطر (برآورد شده)
        Date(1982, 8, 19), # روز استقلال افغانستان
        Date(1982, 9, 26), # روز عرفه (برآورد شده)
        Date(1982, 9, 27), # عید قربانی (برآورد شده)
        Date(1982, 9, 28), # عید قربانی (برآورد شده)
        Date(1982, 9, 29), # عید قربانی (برآورد شده)
        Date(1982, 10, 27), # عاشورا (برآورد شده)
        Date(1982, 12, 27), # میلاد پیامبر (برآورد شده)
        Date(1983, 3, 21), # نوروز
        Date(1983, 5, 1), # روز جهانی کارگر
        Date(1983, 5, 9), # روز پیروزی شوروی
        Date(1983, 6, 12), # اول رمضان (برآورد شده)
        Date(1983, 7, 11), # عید فطر (برآورد شده)
        Date(1983, 7, 12), # عید فطر (برآورد شده)
        Date(1983, 7, 13), # عید فطر (برآورد شده)
        Date(1983, 8, 19), # روز استقلال افغانستان
        Date(1983, 9, 16), # روز عرفه (برآورد شده)
        Date(1983, 9, 17), # عید قربانی (برآورد شده)
        Date(1983, 9, 18), # عید قربانی (برآورد شده)
        Date(1983, 9, 19), # عید قربانی (برآورد شده)
        Date(1983, 10, 16), # عاشورا (برآورد شده)
        Date(1983, 12, 16), # میلاد پیامبر (برآورد شده)
        Date(1984, 3, 21), # نوروز
        Date(1984, 5, 1), # روز جهانی کارگر
        Date(1984, 5, 9), # روز پیروزی شوروی
        Date(1984, 5, 31), # اول رمضان (برآورد شده)
        Date(1984, 6, 30), # عید فطر (برآورد شده)
        Date(1984, 7, 1), # عید فطر (برآورد شده)
        Date(1984, 7, 2), # عید فطر (برآورد شده)
        Date(1984, 8, 19), # روز استقلال افغانستان
        Date(1984, 9, 4), # روز عرفه (برآورد شده)
        Date(1984, 9, 5), # عید قربانی (برآورد شده)
        Date(1984, 9, 6), # عید قربانی (برآورد شده)
        Date(1984, 9, 7), # عید قربانی (برآورد شده)
        Date(1984, 10, 5), # عاشورا (برآورد شده)
        Date(1984, 12, 4), # میلاد پیامبر (برآورد شده)
        Date(1985, 3, 21), # نوروز
        Date(1985, 5, 1), # روز جهانی کارگر
        Date(1985, 5, 9), # روز پیروزی شوروی
        Date(1985, 5, 20), # اول رمضان (برآورد شده)
        Date(1985, 6, 19), # عید فطر (برآورد شده)
        Date(1985, 6, 20), # عید فطر (برآورد شده)
        Date(1985, 6, 21), # عید فطر (برآورد شده)
        Date(1985, 8, 19), # روز استقلال افغانستان
        Date(1985, 8, 25), # روز عرفه (برآورد شده)
        Date(1985, 8, 26), # عید قربانی (برآورد شده)
        Date(1985, 8, 27), # عید قربانی (برآورد شده)
        Date(1985, 8, 28), # عید قربانی (برآورد شده)
        Date(1985, 9, 24), # عاشورا (برآورد شده)
        Date(1985, 11, 24), # میلاد پیامبر (برآورد شده)
        Date(1986, 3, 21), # نوروز
        Date(1986, 5, 1), # روز جهانی کارگر
        Date(1986, 5, 9), # اول رمضان (برآورد شده); روز پیروزی شوروی
        Date(1986, 6, 8), # عید فطر (برآورد شده)
        Date(1986, 6, 9), # عید فطر (برآورد شده)
        Date(1986, 6, 10), # عید فطر (برآورد شده)
        Date(1986, 8, 14), # روز عرفه (برآورد شده)
        Date(1986, 8, 15), # عید قربانی (برآورد شده)
        Date(1986, 8, 16), # عید قربانی (برآورد شده)
        Date(1986, 8, 17), # عید قربانی (برآورد شده)
        Date(1986, 8, 19), # روز استقلال افغانستان
        Date(1986, 9, 14), # عاشورا (برآورد شده)
        Date(1986, 11, 14), # میلاد پیامبر (برآورد شده)
        Date(1987, 3, 21), # نوروز
        Date(1987, 4, 29), # اول رمضان (برآورد شده)
        Date(1987, 5, 1), # روز جهانی کارگر
        Date(1987, 5, 9), # روز پیروزی شوروی
        Date(1987, 5, 28), # عید فطر (برآورد شده)
        Date(1987, 5, 29), # عید فطر (برآورد شده)
        Date(1987, 5, 30), # عید فطر (برآورد شده)
        Date(1987, 8, 3), # روز عرفه (برآورد شده)
        Date(1987, 8, 4), # عید قربانی (برآورد شده)
        Date(1987, 8, 5), # عید قربانی (برآورد شده)
        Date(1987, 8, 6), # عید قربانی (برآورد شده)
        Date(1987, 8, 19), # روز استقلال افغانستان
        Date(1987, 9, 3), # عاشورا (برآورد شده)
        Date(1987, 11, 3), # میلاد پیامبر (برآورد شده)
        Date(1988, 3, 21), # نوروز
        Date(1988, 4, 17), # اول رمضان (برآورد شده)
        Date(1988, 5, 1), # روز جهانی کارگر
        Date(1988, 5, 9), # روز پیروزی شوروی
        Date(1988, 5, 16), # عید فطر (برآورد شده)
        Date(1988, 5, 17), # عید فطر (برآورد شده)
        Date(1988, 5, 18), # عید فطر (برآورد شده)
        Date(1988, 7, 22), # روز عرفه (برآورد شده)
        Date(1988, 7, 23), # عید قربانی (برآورد شده)
        Date(1988, 7, 24), # عید قربانی (برآورد شده)
        Date(1988, 7, 25), # عید قربانی (برآورد شده)
        Date(1988, 8, 19), # روز استقلال افغانستان
        Date(1988, 8, 22), # عاشورا (برآورد شده)
        Date(1988, 10, 22), # میلاد پیامبر (برآورد شده)
        Date(1989, 2, 15), # روز آزادی
        Date(1989, 3, 21), # نوروز
        Date(1989, 4, 7), # اول رمضان (برآورد شده)
        Date(1989, 5, 1), # روز جهانی کارگر
        Date(1989, 5, 6), # عید فطر (برآورد شده)
        Date(1989, 5, 7), # عید فطر (برآورد شده)
        Date(1989, 5, 8), # عید فطر (برآورد شده)
        Date(1989, 7, 12), # روز عرفه (برآورد شده)
        Date(1989, 7, 13), # عید قربانی (برآورد شده)
        Date(1989, 7, 14), # عید قربانی (برآورد شده)
        Date(1989, 7, 15), # عید قربانی (برآورد شده)
        Date(1989, 8, 11), # عاشورا (برآورد شده)
        Date(1989, 8, 19), # روز استقلال افغانستان
        Date(1989, 10, 11), # میلاد پیامبر (برآورد شده)
        Date(1990, 2, 15), # روز آزادی
        Date(1990, 3, 21), # نوروز
        Date(1990, 3, 27), # اول رمضان (برآورد شده)
        Date(1990, 4, 26), # عید فطر (برآورد شده)
        Date(1990, 4, 27), # عید فطر (برآورد شده)
        Date(1990, 4, 28), # عید فطر (برآورد شده)
        Date(1990, 5, 1), # روز جهانی کارگر
        Date(1990, 7, 1), # روز عرفه (برآورد شده)
        Date(1990, 7, 2), # عید قربانی (برآورد شده)
        Date(1990, 7, 3), # عید قربانی (برآورد شده)
        Date(1990, 7, 4), # عید قربانی (برآورد شده)
        Date(1990, 8, 1), # عاشورا (برآورد شده)
        Date(1990, 8, 19), # روز استقلال افغانستان
        Date(1990, 10, 1), # میلاد پیامبر (برآورد شده)
        Date(1991, 2, 15), # روز آزادی
        Date(1991, 3, 17), # اول رمضان (برآورد شده)
        Date(1991, 3, 21), # نوروز
        Date(1991, 4, 15), # عید فطر (برآورد شده)
        Date(1991, 4, 16), # عید فطر (برآورد شده)
        Date(1991, 4, 17), # عید فطر (برآورد شده)
        Date(1991, 5, 1), # روز جهانی کارگر
        Date(1991, 6, 21), # روز عرفه (برآورد شده)
        Date(1991, 6, 22), # عید قربانی (برآورد شده)
        Date(1991, 6, 23), # عید قربانی (برآورد شده)
        Date(1991, 6, 24), # عید قربانی (برآورد شده)
        Date(1991, 7, 21), # عاشورا (برآورد شده)
        Date(1991, 8, 19), # روز استقلال افغانستان
        Date(1991, 9, 20), # میلاد پیامبر (برآورد شده)
        Date(1992, 2, 15), # روز آزادی
        Date(1992, 3, 5), # اول رمضان (برآورد شده)
        Date(1992, 3, 21), # نوروز
        Date(1992, 4, 4), # عید فطر (برآورد شده)
        Date(1992, 4, 5), # عید فطر (برآورد شده)
        Date(1992, 4, 6), # عید فطر (برآورد شده)
        Date(1992, 4, 28), # روز پیروزی مجاهدین
        Date(1992, 5, 1), # روز جهانی کارگر
        Date(1992, 6, 10), # روز عرفه (برآورد شده)
        Date(1992, 6, 11), # عید قربانی (برآورد شده)
        Date(1992, 6, 12), # عید قربانی (برآورد شده)
        Date(1992, 6, 13), # عید قربانی (برآورد شده)
        Date(1992, 7, 10), # عاشورا (برآورد شده)
        Date(1992, 8, 19), # روز استقلال افغانستان
        Date(1992, 9, 9), # میلاد پیامبر (برآورد شده)
        Date(1993, 2, 15), # روز آزادی
        Date(1993, 2, 22), # اول رمضان (برآورد شده)
        Date(1993, 3, 21), # نوروز
        Date(1993, 3, 24), # عید فطر (برآورد شده)
        Date(1993, 3, 25), # عید فطر (برآورد شده)
        Date(1993, 3, 26), # عید فطر (برآورد شده)
        Date(1993, 4, 28), # روز پیروزی مجاهدین
        Date(1993, 5, 1), # روز جهانی کارگر
        Date(1993, 5, 30), # روز عرفه (برآورد شده)
        Date(1993, 5, 31), # عید قربانی (برآورد شده)
        Date(1993, 6, 1), # عید قربانی (برآورد شده)
        Date(1993, 6, 2), # عید قربانی (برآورد شده)
        Date(1993, 6, 30), # عاشورا (برآورد شده)
        Date(1993, 8, 19), # روز استقلال افغانستان
        Date(1993, 8, 29), # میلاد پیامبر (برآورد شده)
        Date(1994, 2, 11), # اول رمضان (برآورد شده)
        Date(1994, 2, 15), # روز آزادی
        Date(1994, 3, 13), # عید فطر (برآورد شده)
        Date(1994, 3, 14), # عید فطر (برآورد شده)
        Date(1994, 3, 15), # عید فطر (برآورد شده)
        Date(1994, 3, 21), # نوروز
        Date(1994, 4, 28), # روز پیروزی مجاهدین
        Date(1994, 5, 1), # روز جهانی کارگر
        Date(1994, 5, 19), # روز عرفه (برآورد شده)
        Date(1994, 5, 20), # عید قربانی (برآورد شده)
        Date(1994, 5, 21), # عید قربانی (برآورد شده)
        Date(1994, 5, 22), # عید قربانی (برآورد شده)
        Date(1994, 6, 19), # عاشورا (برآورد شده)
        Date(1994, 8, 19), # روز استقلال افغانستان; میلاد پیامبر (برآورد شده)
        Date(1995, 1, 31), # اول رمضان (برآورد شده)
        Date(1995, 2, 15), # روز آزادی
        Date(1995, 3, 2), # عید فطر (برآورد شده)
        Date(1995, 3, 3), # عید فطر (برآورد شده)
        Date(1995, 3, 4), # عید فطر (برآورد شده)
        Date(1995, 3, 21), # نوروز
        Date(1995, 4, 28), # روز پیروزی مجاهدین
        Date(1995, 5, 1), # روز جهانی کارگر
        Date(1995, 5, 8), # روز عرفه (برآورد شده)
        Date(1995, 5, 9), # عید قربانی (برآورد شده)
        Date(1995, 5, 10), # عید قربانی (برآورد شده)
        Date(1995, 5, 11), # عید قربانی (برآورد شده)
        Date(1995, 6, 8), # عاشورا (برآورد شده)
        Date(1995, 8, 8), # میلاد پیامبر (برآورد شده)
        Date(1995, 8, 19), # روز استقلال افغانستان
        Date(1996, 1, 21), # اول رمضان (برآورد شده)
        Date(1996, 2, 15), # روز آزادی
        Date(1996, 2, 19), # عید فطر (برآورد شده)
        Date(1996, 2, 20), # عید فطر (برآورد شده)
        Date(1996, 2, 21), # عید فطر (برآورد شده)
        Date(1996, 3, 20), # نوروز
        Date(1996, 4, 26), # روز عرفه (برآورد شده)
        Date(1996, 4, 27), # عید قربانی (برآورد شده)
        Date(1996, 4, 28), # روز پیروزی مجاهدین; عید قربانی (برآورد شده)
        Date(1996, 4, 29), # عید قربانی (برآورد شده)
        Date(1996, 5, 1), # روز جهانی کارگر
        Date(1996, 5, 27), # عاشورا (برآورد شده)
        Date(1996, 7, 27), # میلاد پیامبر (برآورد شده)
        Date(1996, 8, 19), # روز استقلال افغانستان
        Date(1997, 1, 10), # اول رمضان (برآورد شده)
        Date(1997, 2, 8), # عید فطر (برآورد شده)
        Date(1997, 2, 9), # عید فطر (برآورد شده)
        Date(1997, 2, 10), # عید فطر (برآورد شده)
        Date(1997, 2, 15), # روز آزادی
        Date(1997, 4, 16), # روز عرفه (برآورد شده)
        Date(1997, 4, 17), # عید قربانی (برآورد شده)
        Date(1997, 4, 18), # عید قربانی (برآورد شده)
        Date(1997, 4, 19), # عید قربانی (برآورد شده)
        Date(1997, 4, 28), # روز پیروزی مجاهدین
        Date(1997, 5, 16), # عاشورا (برآورد شده)
        Date(1997, 7, 16), # میلاد پیامبر (برآورد شده)
        Date(1997, 8, 19), # روز استقلال افغانستان
        Date(1997, 12, 30), # اول رمضان (برآورد شده)
        Date(1998, 1, 29), # عید فطر (برآورد شده)
        Date(1998, 1, 30), # عید فطر (برآورد شده)
        Date(1998, 1, 31), # عید فطر (برآورد شده)
        Date(1998, 2, 15), # روز آزادی
        Date(1998, 4, 6), # روز عرفه (برآورد شده)
        Date(1998, 4, 7), # عید قربانی (برآورد شده)
        Date(1998, 4, 8), # عید قربانی (برآورد شده)
        Date(1998, 4, 9), # عید قربانی (برآورد شده)
        Date(1998, 4, 28), # روز پیروزی مجاهدین
        Date(1998, 5, 6), # عاشورا (برآورد شده)
        Date(1998, 7, 6), # میلاد پیامبر (برآورد شده)
        Date(1998, 8, 19), # روز استقلال افغانستان
        Date(1998, 12, 19), # اول رمضان (برآورد شده)
        Date(1999, 1, 18), # عید فطر (برآورد شده)
        Date(1999, 1, 19), # عید فطر (برآورد شده)
        Date(1999, 1, 20), # عید فطر (برآورد شده)
        Date(1999, 2, 15), # روز آزادی
        Date(1999, 3, 26), # روز عرفه (برآورد شده)
        Date(1999, 3, 27), # عید قربانی (برآورد شده)
        Date(1999, 3, 28), # عید قربانی (برآورد شده)
        Date(1999, 3, 29), # عید قربانی (برآورد شده)
        Date(1999, 4, 26), # عاشورا (برآورد شده)
        Date(1999, 4, 28), # روز پیروزی مجاهدین
        Date(1999, 6, 26), # میلاد پیامبر (برآورد شده)
        Date(1999, 8, 19), # روز استقلال افغانستان
        Date(1999, 12, 9), # اول رمضان (برآورد شده)
        Date(2000, 1, 8), # عید فطر (برآورد شده)
        Date(2000, 1, 9), # عید فطر (برآورد شده)
        Date(2000, 1, 10), # عید فطر (برآورد شده)
        Date(2000, 2, 15), # روز آزادی
        Date(2000, 3, 15), # روز عرفه (برآورد شده)
        Date(2000, 3, 16), # عید قربانی (برآورد شده)
        Date(2000, 3, 17), # عید قربانی (برآورد شده)
        Date(2000, 3, 18), # عید قربانی (برآورد شده)
        Date(2000, 4, 15), # عاشورا (برآورد شده)
        Date(2000, 4, 28), # روز پیروزی مجاهدین
        Date(2000, 6, 14), # میلاد پیامبر (برآورد شده)
        Date(2000, 8, 19), # روز استقلال افغانستان
        Date(2000, 11, 27), # اول رمضان (برآورد شده)
        Date(2000, 12, 27), # عید فطر (برآورد شده)
        Date(2000, 12, 28), # عید فطر (برآورد شده)
        Date(2000, 12, 29), # عید فطر (برآورد شده)
        Date(2001, 2, 15), # روز آزادی
        Date(2001, 3, 4), # روز عرفه (برآورد شده)
        Date(2001, 3, 5), # عید قربانی (برآورد شده)
        Date(2001, 3, 6), # عید قربانی (برآورد شده)
        Date(2001, 3, 7), # عید قربانی (برآورد شده)
        Date(2001, 3, 21), # نوروز
        Date(2001, 4, 4), # عاشورا (برآورد شده)
        Date(2001, 4, 28), # روز پیروزی مجاهدین
        Date(2001, 6, 4), # میلاد پیامبر (برآورد شده)
        Date(2001, 8, 19), # روز استقلال افغانستان
        Date(2001, 11, 16), # اول رمضان (برآورد شده)
        Date(2001, 12, 16), # عید فطر (برآورد شده)
        Date(2001, 12, 17), # عید فطر (برآورد شده)
        Date(2001, 12, 18), # عید فطر (برآورد شده)
        Date(2002, 2, 15), # روز آزادی
        Date(2002, 2, 21), # روز عرفه (برآورد شده)
        Date(2002, 2, 22), # عید قربانی (برآورد شده)
        Date(2002, 2, 23), # عید قربانی (برآورد شده)
        Date(2002, 2, 24), # عید قربانی (برآورد شده)
        Date(2002, 3, 21), # نوروز
        Date(2002, 3, 24), # عاشورا (برآورد شده)
        Date(2002, 4, 28), # روز پیروزی مجاهدین
        Date(2002, 5, 1), # روز جهانی کارگر
        Date(2002, 5, 24), # میلاد پیامبر (برآورد شده)
        Date(2002, 8, 19), # روز استقلال افغانستان
        Date(2002, 11, 6), # اول رمضان (برآورد شده)
        Date(2002, 12, 5), # عید فطر (برآورد شده)
        Date(2002, 12, 6), # عید فطر (برآورد شده)
        Date(2002, 12, 7), # عید فطر (برآورد شده)
        Date(2003, 2, 10), # روز عرفه (برآورد شده)
        Date(2003, 2, 11), # عید قربانی (برآورد شده)
        Date(2003, 2, 12), # عید قربانی (برآورد شده)
        Date(2003, 2, 13), # عید قربانی (برآورد شده)
        Date(2003, 2, 15), # روز آزادی
        Date(2003, 3, 13), # عاشورا (برآورد شده)
        Date(2003, 3, 21), # نوروز
        Date(2003, 4, 28), # روز پیروزی مجاهدین
        Date(2003, 5, 1), # روز جهانی کارگر
        Date(2003, 5, 13), # میلاد پیامبر (برآورد شده)
        Date(2003, 8, 19), # روز استقلال افغانستان
        Date(2003, 10, 26), # اول رمضان (برآورد شده)
        Date(2003, 11, 25), # عید فطر (برآورد شده)
        Date(2003, 11, 26), # عید فطر (برآورد شده)
        Date(2003, 11, 27), # عید فطر (برآورد شده)
        Date(2004, 1, 31), # روز عرفه (برآورد شده)
        Date(2004, 2, 1), # عید قربانی (برآورد شده)
        Date(2004, 2, 2), # عید قربانی (برآورد شده)
        Date(2004, 2, 3), # عید قربانی (برآورد شده)
        Date(2004, 2, 15), # روز آزادی
        Date(2004, 3, 1), # عاشورا (برآورد شده)
        Date(2004, 3, 20), # نوروز
        Date(2004, 4, 28), # روز پیروزی مجاهدین
        Date(2004, 5, 1), # روز جهانی کارگر; میلاد پیامبر (برآورد شده)
        Date(2004, 8, 19), # روز استقلال افغانستان
        Date(2004, 10, 15), # اول رمضان (برآورد شده)
        Date(2004, 11, 14), # عید فطر (برآورد شده)
        Date(2004, 11, 15), # عید فطر (برآورد شده)
        Date(2004, 11, 16), # عید فطر (برآورد شده)
        Date(2005, 1, 20), # روز عرفه (برآورد شده)
        Date(2005, 1, 21), # عید قربانی (برآورد شده)
        Date(2005, 1, 22), # عید قربانی (برآورد شده)
        Date(2005, 1, 23), # عید قربانی (برآورد شده)
        Date(2005, 2, 15), # روز آزادی
        Date(2005, 2, 19), # عاشورا (برآورد شده)
        Date(2005, 3, 21), # نوروز
        Date(2005, 4, 21), # میلاد پیامبر (برآورد شده)
        Date(2005, 4, 28), # روز پیروزی مجاهدین
        Date(2005, 5, 1), # روز جهانی کارگر
        Date(2005, 8, 19), # روز استقلال افغانستان
        Date(2005, 10, 4), # اول رمضان (برآورد شده)
        Date(2005, 11, 3), # عید فطر (برآورد شده)
        Date(2005, 11, 4), # عید فطر (برآورد شده)
        Date(2005, 11, 5), # عید فطر (برآورد شده)
        Date(2006, 1, 9), # روز عرفه (برآورد شده)
        Date(2006, 1, 10), # عید قربانی (برآورد شده)
        Date(2006, 1, 11), # عید قربانی (برآورد شده)
        Date(2006, 1, 12), # عید قربانی (برآورد شده)
        Date(2006, 2, 9), # عاشورا (برآورد شده)
        Date(2006, 2, 15), # روز آزادی
        Date(2006, 3, 21), # نوروز
        Date(2006, 4, 10), # میلاد پیامبر (برآورد شده)
        Date(2006, 4, 28), # روز پیروزی مجاهدین
        Date(2006, 5, 1), # روز جهانی کارگر
        Date(2006, 8, 19), # روز استقلال افغانستان
        Date(2006, 9, 24), # اول رمضان (برآورد شده)
        Date(2006, 10, 23), # عید فطر (برآورد شده)
        Date(2006, 10, 24), # عید فطر (برآورد شده)
        Date(2006, 10, 25), # عید فطر (برآورد شده)
        Date(2006, 12, 30), # روز عرفه (برآورد شده)
        Date(2006, 12, 31), # عید قربانی (برآورد شده)
        Date(2007, 1, 1), # عید قربانی (برآورد شده)
        Date(2007, 1, 2), # عید قربانی (برآورد شده)
        Date(2007, 1, 29), # عاشورا (برآورد شده)
        Date(2007, 2, 15), # روز آزادی
        Date(2007, 3, 21), # نوروز
        Date(2007, 3, 31), # میلاد پیامبر (برآورد شده)
        Date(2007, 4, 28), # روز پیروزی مجاهدین
        Date(2007, 5, 1), # روز جهانی کارگر
        Date(2007, 8, 19), # روز استقلال افغانستان
        Date(2007, 9, 13), # اول رمضان (برآورد شده)
        Date(2007, 10, 13), # عید فطر (برآورد شده)
        Date(2007, 10, 14), # عید فطر (برآورد شده)
        Date(2007, 10, 15), # عید فطر (برآورد شده)
        Date(2007, 12, 19), # روز عرفه (برآورد شده)
        Date(2007, 12, 20), # عید قربانی (برآورد شده)
        Date(2007, 12, 21), # عید قربانی (برآورد شده)
        Date(2007, 12, 22), # عید قربانی (برآورد شده)
        Date(2008, 1, 19), # عاشورا (برآورد شده)
        Date(2008, 2, 15), # روز آزادی
        Date(2008, 3, 20), # میلاد پیامبر (برآورد شده); نوروز
        Date(2008, 4, 28), # روز پیروزی مجاهدین
        Date(2008, 5, 1), # روز جهانی کارگر
        Date(2008, 8, 19), # روز استقلال افغانستان
        Date(2008, 9, 1), # اول رمضان (برآورد شده)
        Date(2008, 10, 1), # عید فطر (برآورد شده)
        Date(2008, 10, 2), # عید فطر (برآورد شده)
        Date(2008, 10, 3), # عید فطر (برآورد شده)
        Date(2008, 12, 7), # روز عرفه (برآورد شده)
        Date(2008, 12, 8), # عید قربانی (برآورد شده)
        Date(2008, 12, 9), # عید قربانی (برآورد شده)
        Date(2008, 12, 10), # عید قربانی (برآورد شده)
        Date(2009, 1, 7), # عاشورا (برآورد شده)
        Date(2009, 2, 15), # روز آزادی
        Date(2009, 3, 9), # میلاد پیامبر (برآورد شده)
        Date(2009, 3, 21), # نوروز
        Date(2009, 4, 28), # روز پیروزی مجاهدین
        Date(2009, 5, 1), # روز جهانی کارگر
        Date(2009, 8, 19), # روز استقلال افغانستان
        Date(2009, 8, 22), # اول رمضان (برآورد شده)
        Date(2009, 9, 20), # عید فطر (برآورد شده)
        Date(2009, 9, 21), # عید فطر (برآورد شده)
        Date(2009, 9, 22), # عید فطر (برآورد شده)
        Date(2009, 11, 26), # روز عرفه (برآورد شده)
        Date(2009, 11, 27), # عید قربانی (برآورد شده)
        Date(2009, 11, 28), # عید قربانی (برآورد شده)
        Date(2009, 11, 29), # عید قربانی (برآورد شده)
        Date(2009, 12, 27), # عاشورا (برآورد شده)
        Date(2010, 2, 15), # روز آزادی
        Date(2010, 2, 26), # میلاد پیامبر (برآورد شده)
        Date(2010, 3, 21), # نوروز
        Date(2010, 4, 28), # روز پیروزی مجاهدین
        Date(2010, 5, 1), # روز جهانی کارگر
        Date(2010, 8, 11), # اول رمضان (برآورد شده)
        Date(2010, 8, 19), # روز استقلال افغانستان
        Date(2010, 9, 10), # عید فطر (برآورد شده)
        Date(2010, 9, 11), # عید فطر (برآورد شده)
        Date(2010, 9, 12), # عید فطر (برآورد شده)
        Date(2010, 11, 15), # روز عرفه (برآورد شده)
        Date(2010, 11, 16), # عید قربانی (برآورد شده)
        Date(2010, 11, 17), # عید قربانی (برآورد شده)
        Date(2010, 11, 18), # عید قربانی (برآورد شده)
        Date(2010, 12, 16), # عاشورا (برآورد شده)
        Date(2011, 2, 15), # روز آزادی; میلاد پیامبر (برآورد شده)
        Date(2011, 3, 21), # نوروز
        Date(2011, 4, 28), # روز پیروزی مجاهدین
        Date(2011, 5, 1), # روز جهانی کارگر
        Date(2011, 8, 1), # اول رمضان (برآورد شده)
        Date(2011, 8, 19), # روز استقلال افغانستان
        Date(2011, 8, 30), # عید فطر (برآورد شده)
        Date(2011, 8, 31), # عید فطر (برآورد شده)
        Date(2011, 9, 1), # عید فطر (برآورد شده)
        Date(2011, 11, 5), # روز عرفه (برآورد شده)
        Date(2011, 11, 6), # عید قربانی (برآورد شده)
        Date(2011, 11, 7), # عید قربانی (برآورد شده)
        Date(2011, 11, 8), # عید قربانی (برآورد شده)
        Date(2011, 12, 5), # عاشورا (برآورد شده)
        Date(2012, 2, 4), # میلاد پیامبر (برآورد شده)
        Date(2012, 2, 15), # روز آزادی
        Date(2012, 3, 20), # نوروز
        Date(2012, 4, 28), # روز پیروزی مجاهدین
        Date(2012, 5, 1), # روز جهانی کارگر
        Date(2012, 7, 20), # اول رمضان (برآورد شده)
        Date(2012, 8, 19), # روز استقلال افغانستان; عید فطر (برآورد شده)
        Date(2012, 8, 20), # عید فطر (برآورد شده)
        Date(2012, 8, 21), # عید فطر (برآورد شده)
        Date(2012, 9, 9), # روز شهیدان
        Date(2012, 10, 25), # روز عرفه (برآورد شده)
        Date(2012, 10, 26), # عید قربانی (برآورد شده)
        Date(2012, 10, 27), # عید قربانی (برآورد شده)
        Date(2012, 10, 28), # عید قربانی (برآورد شده)
        Date(2012, 11, 24), # عاشورا (برآورد شده)
        Date(2013, 1, 24), # میلاد پیامبر (برآورد شده)
        Date(2013, 2, 15), # روز آزادی
        Date(2013, 3, 21), # نوروز
        Date(2013, 4, 28), # روز پیروزی مجاهدین
        Date(2013, 5, 1), # روز جهانی کارگر
        Date(2013, 7, 9), # اول رمضان (برآورد شده)
        Date(2013, 8, 8), # عید فطر (برآورد شده)
        Date(2013, 8, 9), # عید فطر (برآورد شده)
        Date(2013, 8, 10), # عید فطر (برآورد شده)
        Date(2013, 8, 19), # روز استقلال افغانستان
        Date(2013, 9, 9), # روز شهیدان
        Date(2013, 10, 14), # روز عرفه (برآورد شده)
        Date(2013, 10, 15), # عید قربانی (برآورد شده)
        Date(2013, 10, 16), # عید قربانی (برآورد شده)
        Date(2013, 10, 17), # عید قربانی (برآورد شده)
        Date(2013, 11, 13), # عاشورا (برآورد شده)
        Date(2014, 1, 14), # میلاد پیامبر
        Date(2014, 2, 15), # روز آزادی
        Date(2014, 3, 21), # نوروز
        Date(2014, 4, 28), # روز پیروزی مجاهدین
        Date(2014, 5, 1), # روز جهانی کارگر
        Date(2014, 6, 29), # اول رمضان
        Date(2014, 7, 29), # عید فطر
        Date(2014, 7, 30), # عید فطر
        Date(2014, 7, 31), # عید فطر
        Date(2014, 8, 19), # روز استقلال افغانستان
        Date(2014, 9, 9), # روز شهیدان
        Date(2014, 10, 4), # روز عرفه
        Date(2014, 10, 5), # عید قربانی
        Date(2014, 10, 6), # عید قربانی
        Date(2014, 10, 7), # عید قربانی
        Date(2014, 11, 3), # عاشورا
        Date(2015, 1, 3), # میلاد پیامبر
        Date(2015, 2, 15), # روز آزادی
        Date(2015, 3, 21), # نوروز
        Date(2015, 4, 28), # روز پیروزی مجاهدین
        Date(2015, 5, 1), # روز جهانی کارگر
        Date(2015, 6, 18), # اول رمضان
        Date(2015, 7, 18), # عید فطر
        Date(2015, 7, 19), # عید فطر
        Date(2015, 7, 20), # عید فطر
        Date(2015, 8, 19), # روز استقلال افغانستان
        Date(2015, 9, 9), # روز شهیدان
        Date(2015, 9, 22), # روز عرفه
        Date(2015, 9, 23), # عید قربانی
        Date(2015, 9, 24), # عید قربانی
        Date(2015, 9, 25), # عید قربانی
        Date(2015, 10, 24), # عاشورا
        Date(2015, 12, 24), # میلاد پیامبر
        Date(2016, 2, 15), # روز آزادی
        Date(2016, 3, 20), # نوروز
        Date(2016, 4, 28), # روز پیروزی مجاهدین
        Date(2016, 5, 1), # روز جهانی کارگر
        Date(2016, 6, 7), # اول رمضان
        Date(2016, 7, 7), # عید فطر
        Date(2016, 7, 8), # عید فطر
        Date(2016, 7, 9), # عید فطر
        Date(2016, 8, 19), # روز استقلال افغانستان
        Date(2016, 9, 9), # روز شهیدان
        Date(2016, 9, 12), # روز عرفه
        Date(2016, 9, 13), # عید قربانی
        Date(2016, 9, 14), # عید قربانی
        Date(2016, 9, 15), # عید قربانی
        Date(2016, 10, 12), # عاشورا
        Date(2016, 12, 12), # میلاد پیامبر
        Date(2017, 2, 15), # روز آزادی
        Date(2017, 3, 21), # نوروز
        Date(2017, 4, 28), # روز پیروزی مجاهدین
        Date(2017, 5, 1), # روز جهانی کارگر
        Date(2017, 5, 27), # اول رمضان
        Date(2017, 6, 26), # عید فطر
        Date(2017, 6, 27), # عید فطر
        Date(2017, 6, 28), # عید فطر
        Date(2017, 8, 19), # روز استقلال افغانستان
        Date(2017, 9, 1), # روز عرفه
        Date(2017, 9, 2), # عید قربانی
        Date(2017, 9, 3), # عید قربانی
        Date(2017, 9, 4), # عید قربانی
        Date(2017, 9, 9), # روز شهیدان
        Date(2017, 10, 1), # عاشورا
        Date(2017, 12, 1), # میلاد پیامبر
        Date(2018, 2, 15), # روز آزادی
        Date(2018, 3, 21), # نوروز
        Date(2018, 4, 28), # روز پیروزی مجاهدین
        Date(2018, 5, 1), # روز جهانی کارگر
        Date(2018, 5, 16), # اول رمضان
        Date(2018, 6, 15), # عید فطر
        Date(2018, 6, 16), # عید فطر
        Date(2018, 6, 17), # عید فطر
        Date(2018, 8, 19), # روز استقلال افغانستان
        Date(2018, 8, 21), # روز عرفه
        Date(2018, 8, 22), # عید قربانی
        Date(2018, 8, 23), # عید قربانی
        Date(2018, 8, 24), # عید قربانی
        Date(2018, 9, 9), # روز شهیدان
        Date(2018, 9, 21), # عاشورا
        Date(2018, 11, 21), # میلاد پیامبر
        Date(2019, 2, 15), # روز آزادی
        Date(2019, 3, 21), # نوروز
        Date(2019, 4, 28), # روز پیروزی مجاهدین
        Date(2019, 5, 1), # روز جهانی کارگر
        Date(2019, 5, 6), # اول رمضان
        Date(2019, 6, 4), # عید فطر
        Date(2019, 6, 5), # عید فطر
        Date(2019, 6, 6), # عید فطر
        Date(2019, 8, 10), # روز عرفه
        Date(2019, 8, 11), # عید قربانی
        Date(2019, 8, 12), # عید قربانی
        Date(2019, 8, 13), # عید قربانی
        Date(2019, 8, 19), # روز استقلال افغانستان
        Date(2019, 9, 9), # روز شهیدان
        Date(2019, 9, 10), # عاشورا
        Date(2019, 11, 10), # میلاد پیامبر
        Date(2020, 2, 15), # روز آزادی
        Date(2020, 3, 20), # نوروز
        Date(2020, 4, 24), # اول رمضان
        Date(2020, 4, 28), # روز پیروزی مجاهدین
        Date(2020, 5, 1), # روز جهانی کارگر
        Date(2020, 5, 24), # عید فطر
        Date(2020, 5, 25), # عید فطر
        Date(2020, 5, 26), # عید فطر
        Date(2020, 7, 30), # روز عرفه
        Date(2020, 7, 31), # عید قربانی
        Date(2020, 8, 1), # عید قربانی
        Date(2020, 8, 2), # عید قربانی
        Date(2020, 8, 19), # روز استقلال افغانستان
        Date(2020, 8, 30), # عاشورا
        Date(2020, 9, 9), # روز شهیدان
        Date(2020, 10, 29), # میلاد پیامبر
        Date(2021, 2, 15), # روز آزادی
        Date(2021, 4, 13), # اول رمضان
        Date(2021, 4, 28), # روز پیروزی مجاهدین
        Date(2021, 5, 1), # روز جهانی کارگر
        Date(2021, 5, 13), # عید فطر
        Date(2021, 5, 14), # عید فطر
        Date(2021, 5, 15), # عید فطر
        Date(2021, 7, 19), # روز عرفه
        Date(2021, 7, 20), # عید قربانی
        Date(2021, 7, 21), # عید قربانی
        Date(2021, 7, 22), # عید قربانی
        Date(2021, 8, 19), # روز استقلال افغانستان; عاشورا
        Date(2021, 10, 19), # میلاد پیامبر
        Date(2022, 2, 15), # روز آزادی
        Date(2022, 4, 2), # اول رمضان
        Date(2022, 4, 28), # روز پیروزی مجاهدین
        Date(2022, 5, 1), # عید فطر
        Date(2022, 5, 2), # عید فطر
        Date(2022, 5, 3), # عید فطر
        Date(2022, 7, 8), # روز عرفه
        Date(2022, 7, 9), # عید قربانی
        Date(2022, 7, 10), # عید قربانی
        Date(2022, 7, 11), # عید قربانی
        Date(2022, 8, 15), # روز پیروزی امارت اسلامی
        Date(2022, 8, 19), # روز استقلال افغانستان
        Date(2022, 8, 31), # روز خروج آمریکایی ها
        Date(2022, 10, 8), # میلاد پیامبر
        Date(2023, 2, 15), # روز آزادی
        Date(2023, 3, 23), # اول رمضان
        Date(2023, 4, 22), # عید فطر
        Date(2023, 4, 23), # عید فطر
        Date(2023, 4, 24), # عید فطر
        Date(2023, 4, 28), # روز پیروزی مجاهدین
        Date(2023, 6, 27), # روز عرفه
        Date(2023, 6, 28), # عید قربانی
        Date(2023, 6, 29), # عید قربانی
        Date(2023, 6, 30), # عید قربانی
        Date(2023, 8, 15), # روز پیروزی امارت اسلامی
        Date(2023, 8, 19), # روز استقلال افغانستان
        Date(2023, 8, 31), # روز خروج آمریکایی ها
        Date(2023, 9, 27), # میلاد پیامبر
        Date(2024, 2, 15), # روز آزادی
        Date(2024, 3, 11), # اول رمضان
        Date(2024, 4, 10), # عید فطر
        Date(2024, 4, 11), # عید فطر
        Date(2024, 4, 12), # عید فطر
        Date(2024, 4, 28), # روز پیروزی مجاهدین
        Date(2024, 6, 16), # روز عرفه
        Date(2024, 6, 17), # عید قربانی
        Date(2024, 6, 18), # عید قربانی
        Date(2024, 6, 19), # عید قربانی
        Date(2024, 8, 14), # روز پیروزی امارت اسلامی
        Date(2024, 8, 19), # روز استقلال افغانستان
        Date(2024, 8, 31), # روز خروج آمریکایی ها
        Date(2024, 9, 16), # میلاد پیامبر
        Date(2025, 2, 15), # روز آزادی
        Date(2025, 3, 1), # اول رمضان (برآورد شده)
        Date(2025, 3, 30), # عید فطر (برآورد شده)
        Date(2025, 3, 31), # عید فطر (برآورد شده)
        Date(2025, 4, 1), # عید فطر (برآورد شده)
        Date(2025, 4, 28), # روز پیروزی مجاهدین
        Date(2025, 6, 5), # روز عرفه (برآورد شده)
        Date(2025, 6, 6), # عید قربانی (برآورد شده)
        Date(2025, 6, 7), # عید قربانی (برآورد شده)
        Date(2025, 6, 8), # عید قربانی (برآورد شده)
        Date(2025, 8, 15), # روز پیروزی امارت اسلامی
        Date(2025, 8, 19), # روز استقلال افغانستان
        Date(2025, 8, 31), # روز خروج آمریکایی ها
        Date(2025, 9, 4), # میلاد پیامبر (برآورد شده)
        Date(2026, 2, 15), # روز آزادی
        Date(2026, 2, 18), # اول رمضان (برآورد شده)
        Date(2026, 3, 20), # عید فطر (برآورد شده)
        Date(2026, 3, 21), # عید فطر (برآورد شده)
        Date(2026, 3, 22), # عید فطر (برآورد شده)
        Date(2026, 4, 28), # روز پیروزی مجاهدین
        Date(2026, 5, 26), # روز عرفه (برآورد شده)
        Date(2026, 5, 27), # عید قربانی (برآورد شده)
        Date(2026, 5, 28), # عید قربانی (برآورد شده)
        Date(2026, 5, 29), # عید قربانی (برآورد شده)
        Date(2026, 8, 15), # روز پیروزی امارت اسلامی
        Date(2026, 8, 19), # روز استقلال افغانستان
        Date(2026, 8, 25), # میلاد پیامبر (برآورد شده)
        Date(2026, 8, 31), # روز خروج آمریکایی ها
        Date(2027, 2, 8), # اول رمضان (برآورد شده)
        Date(2027, 2, 15), # روز آزادی
        Date(2027, 3, 9), # عید فطر (برآورد شده)
        Date(2027, 3, 10), # عید فطر (برآورد شده)
        Date(2027, 3, 11), # عید فطر (برآورد شده)
        Date(2027, 4, 28), # روز پیروزی مجاهدین
        Date(2027, 5, 15), # روز عرفه (برآورد شده)
        Date(2027, 5, 16), # عید قربانی (برآورد شده)
        Date(2027, 5, 17), # عید قربانی (برآورد شده)
        Date(2027, 5, 18), # عید قربانی (برآورد شده)
        Date(2027, 8, 14), # میلاد پیامبر (برآورد شده)
        Date(2027, 8, 15), # روز پیروزی امارت اسلامی
        Date(2027, 8, 19), # روز استقلال افغانستان
        Date(2027, 8, 31), # روز خروج آمریکایی ها
        Date(2028, 1, 28), # اول رمضان (برآورد شده)
        Date(2028, 2, 15), # روز آزادی
        Date(2028, 2, 26), # عید فطر (برآورد شده)
        Date(2028, 2, 27), # عید فطر (برآورد شده)
        Date(2028, 2, 28), # عید فطر (برآورد شده)
        Date(2028, 4, 28), # روز پیروزی مجاهدین
        Date(2028, 5, 4), # روز عرفه (برآورد شده)
        Date(2028, 5, 5), # عید قربانی (برآورد شده)
        Date(2028, 5, 6), # عید قربانی (برآورد شده)
        Date(2028, 5, 7), # عید قربانی (برآورد شده)
        Date(2028, 8, 3), # میلاد پیامبر (برآورد شده)
        Date(2028, 8, 14), # روز پیروزی امارت اسلامی
        Date(2028, 8, 19), # روز استقلال افغانستان
        Date(2028, 8, 31), # روز خروج آمریکایی ها
        Date(2029, 1, 16), # اول رمضان (برآورد شده)
        Date(2029, 2, 14), # عید فطر (برآورد شده)
        Date(2029, 2, 15), # روز آزادی; عید فطر (برآورد شده)
        Date(2029, 2, 16), # عید فطر (برآورد شده)
        Date(2029, 4, 23), # روز عرفه (برآورد شده)
        Date(2029, 4, 24), # عید قربانی (برآورد شده)
        Date(2029, 4, 25), # عید قربانی (برآورد شده)
        Date(2029, 4, 26), # عید قربانی (برآورد شده)
        Date(2029, 4, 28), # روز پیروزی مجاهدین
        Date(2029, 7, 24), # میلاد پیامبر (برآورد شده)
        Date(2029, 8, 14), # روز پیروزی امارت اسلامی
        Date(2029, 8, 19), # روز استقلال افغانستان
        Date(2029, 8, 31), # روز خروج آمریکایی ها
        Date(2030, 1, 5), # اول رمضان (برآورد شده)
        Date(2030, 2, 4), # عید فطر (برآورد شده)
        Date(2030, 2, 5), # عید فطر (برآورد شده)
        Date(2030, 2, 6), # عید فطر (برآورد شده)
        Date(2030, 2, 15), # روز آزادی
        Date(2030, 4, 12), # روز عرفه (برآورد شده)
        Date(2030, 4, 13), # عید قربانی (برآورد شده)
        Date(2030, 4, 14), # عید قربانی (برآورد شده)
        Date(2030, 4, 15), # عید قربانی (برآورد شده)
        Date(2030, 4, 28), # روز پیروزی مجاهدین
        Date(2030, 7, 13), # میلاد پیامبر (برآورد شده)
        Date(2030, 8, 15), # روز پیروزی امارت اسلامی
        Date(2030, 8, 19), # روز استقلال افغانستان
        Date(2030, 8, 31), # روز خروج آمریکایی ها
        Date(2030, 12, 26), # اول رمضان (برآورد شده)
    ]

    test_holidays(calendar, holidays)

    return nothing
end

end
